posts/nikola-guide/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Nikola Guide | HitchHikers guide to Ethical Hacking</title>
<link href="../../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/html4css1.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_rst.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/theme.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://djgoldsmith.github.io/EH-H2GH/posts/nikola-guide/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Dang">
<link rel="prev" href="../recon/nmap/" title="Reconnaissance:  Nmap" type="text/html">
<meta property="og:site_name" content="HitchHikers guide to Ethical Hacking">
<meta property="og:title" content="Nikola Guide">
<meta property="og:url" content="http://djgoldsmith.github.io/EH-H2GH/posts/nikola-guide/">
<meta property="og:description" content="Nikola is used to generate nice(er) looking static sites from markup language (org, markdown etc) documents
Notes for Org mode and Nikola





Creating Pages

#Automagically collected posts
(env)$niko">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-08-18T07:50:19Z">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://djgoldsmith.github.io/EH-H2GH/">

                <span id="blog-title">HitchHikers guide to Ethical Hacking</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../">Articles</a>
                </li>
<li>
<a href="../../posts">Posts</a>
                </li>
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Nikola Guide</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Dang
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-08-18T07:50:19Z" itemprop="datePublished" title="2017-08-18 07:50">2017-08-18 07:50</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Nikola is used to generate nice(er) looking static sites from markup language (org, markdown etc) documents
Notes for Org mode and Nikola
</p>

<!-- TEASER_END -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Creating Pages</h2>
<div class="outline-text-2" id="text-1">
<div class="highlight"><pre><span></span><span class="c1">#Automagically collected posts</span>
<span class="o">(</span>env<span class="o">)</span><span class="nv">$nikola</span> new_post -f orgmode &lt;path&gt;

<span class="c1">#For a more tradtional page based site</span>
<span class="o">(</span>env<span class="o">)</span><span class="nv">$nikola</span> new_page -f orgmode &lt;path&gt;
</pre></div>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Standard header</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Title (Page title itself)
</li>
<li>Slug  (Page URL)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Teaser</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Cuts off the content on the main index page
</p>

<div class="highlight"><pre><span></span>Nikola is used to generate nice(er) looking static sites from markup language (org, markdown etc) documents
Notes for Org mode and Nikola

{{{TEASER_END}}}
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Content</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Headings are as per standard org mode export. 
</li>
<li>Bullets work also 
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Source Code</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Pygments is used, so some of the standard org-babel codes don't work.
</p>

<ul class="org-ul">
<li>Bash == sh
</li>
</ul>
<pre class="example">
#+BEGIN_SRC sh
$ls -l
#+END_SRC
</pre>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Adding Class level formatting</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
#+ATTR_HTML: :class table table-striped
</pre>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Tables</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Getting the nicer bootstrap formatting
</p>

<pre class="example">
#+ATTR_HTML: :class table table-striped
| Foo | Bar |
|-----+-----|
|   1 |   2 |
|   3 |   4 |
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="table table-striped">
<colgroup>
<col class="right">
<col class="right">
</colgroup>
<thead><tr>
<th scope="col" class="right">Foo</th>
<th scope="col" class="right">Bar</th>
</tr></thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="right">2</td>
</tr>
<tr>
<td class="right">3</td>
<td class="right">4</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../recon/nmap/" rel="prev" title="Reconnaissance:  Nmap">Previous post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:aa9863@coventry.ac.uk">CUEH</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/jquery.min.js"></script><script src="../../assets/js/bootstrap.min.js"></script><script src="../../assets/js/moment-with-locales.min.js"></script><script src="../../assets/js/fancydates.js"></script><script src="../../assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
